Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometryException Class
 The ConnectiveGeometryException class represents an error that occurred during the ConnectiveGeometry creation or modification.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.ConnectiveGeometryException
 More...
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ConnectiveGeometryException : Exception
<SerializableAttribute>
Public Class ConnectiveGeometryException
	Inherits Exception
The ConnectiveGeometryException type exposes the following members.
Constructors
Name | Description
ConnectiveGeometryException()
 Initializes a new instance of the ConnectiveGeometryException class with general connective geometry error message.
ConnectiveGeometryException(BentPlateGeometrySolver.OperationStatus, String)
 Initializes a new instance of the ConnectiveGeometryException class with connective geometry error message based on status.
Top
Fields
Name | Description
OperationStatus
 Possible error statuses for geometry creation/modification commands.
Top
See Also
Reference
Tekla.Structures.Model Namespace
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.ConnectiveGeometryException
 Tekla.Structures.Model.ExtensionIntersectsWithPlateException
 Tekla.Structures.Model.FacePerpendicularToIntersectionLineException
 Tekla.Structures.Model.FacesAtAnObtuseAngleException
 Tekla.Structures.Model.FacesTooNearEachOtherException
 Tekla.Structures.Model.GeneralConnectiveGeometryException
 Tekla.Structures.Model.InvalidFacePointsException
 Tekla.Structures.Model.InvalidRadiusException
 Tekla.Structures.Model.PlateIntersectsWithIntersectionLineException
 Tekla.Structures.Model.UndefinedCurveDirectionException
 Tekla.Structures.Model.UnsupportedChamferException